
// =====================================
// ТОВАРИ
// =====================================

var products = {

    espresso: `
        <h2>Еспресо</h2>

        <p class="price">40 ₴</p>

        <h3>Кава</h3>

        <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>

        <h3>Додатки</h3>

        <ul>
            <li>+ еспресо купаж +10 ₴</li>
            <li>+ еспресо арабіка +15 ₴</li>
            <li>+ сироп</li>
        </ul>

        <h3>Молоко 180 мл</h3>

        <ul>
            <li>Звичайне +8 ₴</li>
            <li>Кокосове +15 ₴</li>
            <li>Безлактозне +15 ₴</li>
            <li>Мигдалеве +15 ₴</li>
            <li>Бананове +15 ₴</li>
        </ul>
    `,



    cappuccino: `
        <h2>Капучино 250</h2>

        <p class="price">62 ₴</p>

        <h3>Кава</h3>

        <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>

        <h3>Молоко 250 мл</h3>

        <ul>
            <li>Звичайне</li>
            <li>Кокосове +15 ₴</li>
            <li>Бананове +15 ₴</li>
            <li>Безлактозне +10 ₴</li>
            <li>Мигдалеве +15 ₴</li>
        </ul>

        <h3>Додатки</h3>

        <ul>
            <li>+ еспресо купаж +10 ₴</li>
            <li>+ еспресо арабіка +15 ₴</li>
            <li>+ сироп</li>
        </ul>
    `,



    flatwhite: `
        <h2>Флет Вайт</h2>

        <p class="price">78 ₴</p>

        <h3>Кава</h3>

        <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>

        <h3>Молоко 250 мл</h3>

        <ul>
            <li>Звичайне</li>
            <li>Кокосове +15 ₴</li>
            <li>Бананове +15 ₴</li>
            <li>Безлактозне +10 ₴</li>
            <li>Мигдалеве +15 ₴</li>
        </ul>

        <h3>Додатки</h3>

        <ul>
            <li>+ еспресо купаж +10 ₴</li>
            <li>+ еспресо арабіка +15 ₴</li>
            <li>+ сироп</li>
        </ul>
    `,



    latte: `
        <h2>Лате 250</h2>

        <p class="price">62 ₴</p>

        <h3>Кава</h3>

        <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>

        <h3>Молоко 250 мл</h3>

        <ul>
            <li>Звичайне</li>
            <li>Кокосове +15 ₴</li>
            <li>Бананове +15 ₴</li>
            <li>Безлактозне +10 ₴</li>
            <li>Мигдалеве +15 ₴</li>
        </ul>

        <h3>Додатки</h3>

        <ul>
            <li>+ еспресо купаж +10 ₴</li>
            <li>+ еспресо арабіка +15 ₴</li>
            <li>+ сироп</li>
        </ul>
    `,



    americano: `
        <h2>Американо</h2>

        <p class="price">42 ₴</p>

        <h3>Кава</h3>

        <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>

        <h3>Додатки</h3>

        <ul>
            <li>+ еспресо купаж +10 ₴</li>
            <li>+ еспресо арабіка +15 ₴</li>
            <li>+ сироп</li>
        </ul>
    `,



    raf: `
        <h2>Раф</h2>

        <p class="price">82 ₴</p>

        <h3>Кава</h3>

        <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>
    `,

    dopio: `
        <h2>Допіо</h2>

        <p class="price">82 ₴</p>
        
        <h3>Кава</h3>

         <ul>
            <li>Кава купаж</li>
            <li>Кава Арабіка +5 ₴</li>
            <li>Кава Декаф +10 ₴</li>
        </ul>

    `,
    croissant: `
        <h2>Круасан солоний</h2>

        <h3>Різновиди</h3>

        <ul>
            <li>Круасан з куркою — 160 ₴</li>
            <li>Круасан з лососем — 175 ₴</li>
            <li>Круасан з шинкою — 160 ₴</li>
        </ul>
    `,



    cheesecake: `
        <h2>Чізкейк</h2>

        <h3>Різновиди</h3>

        <ul>
            <li>Снікерс — 165 ₴</li>
            <li>Малиновий — 165 ₴</li>
        </ul>
    `
};



function openProduct(product) {

    $("#product-content").html(
        products[product]
    );

    $("#product-modal").css(
        "display",
        "flex"
    );
}



function closeProduct() {

    $("#product-modal").fadeOut(200);
}



$("#product-modal").click(function(e){

    if(e.target === this){

        closeProduct();

    }

});
$(window).scroll(function(){

    if($(window).scrollTop() > 50){

        $(".navbar").css(
            "box-shadow",
            "0 8px 25px rgba(0,0,0,.15)"
        );

    }

    else{

        $(".navbar").css(
            "box-shadow",
            "0 3px 20px rgba(0,0,0,.08)"
        );

    }

});